cinema-catalog-service/integration-test/cinema-catalog-service-api.jmeter.test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Movies service" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Gestor de Cabecera HTTP" enabled="true">
        <collectionProp name="HeaderManager.headers"/>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Item API Perf Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">100</stringProp>
        <longProp name="ThreadGroup.start_time">1485133702000</longProp>
        <longProp name="ThreadGroup.end_time">1485133702000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Valores por Defecto para Petición HTTP" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">https://v0i3f8l84m.execute-api.ap-northeast-1.amazonaws.com/dev</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Fetch cinemas cinema_id movie_id" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">v0i3f8l84m.execute-api.ap-northeast-1.amazonaws.com</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/dev/api/cinemas/588ac3a02d029a6d15d0b5c4/1</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept-Language</stringProp>
                <stringProp name="Header.value">ja-JP</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Geolocation</stringProp>
                <stringProp name="Header.value">Position=[1.2556618, 103.81834472]</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJvK1liN0dzZGNwd3JGRDdCVzlESlpSSW1JblJsa2FZT0Z2SGFaMEoyamo4PSIsImFsZyI6IlJTMjU2In0.eyJzdWIiOiJmZWFmODZkMi1iNDVkLTRjYmItYWU1Yy1kNDU4ZTdiZDA1Y2QiLCJldmVudF9pZCI6ImU0NDcyZDg2LWYyNmEtNDQzZi1hN2YxLTYyODljZjZkMDVhYiIsInRva2VuX3VzZSI6ImFjY2VzcyIsInNjb3BlIjoiYXdzLmNvZ25pdG8uc2lnbmluLnVzZXIuYWRtaW4iLCJhdXRoX3RpbWUiOjE1NjIzMjE3ODgsImlzcyI6Imh0dHBzOlwvXC9jb2duaXRvLWlkcC5hcC1zb3V0aGVhc3QtMS5hbWF6b25hd3MuY29tXC9hcC1zb3V0aGVhc3QtMV9tc0tXbkJGZEoiLCJleHAiOjE1NjIzMjUzODgsImlhdCI6MTU2MjMyMTc4OCwianRpIjoiZTNiYzI0MWMtZGJiMy00ZGZlLTgwYjYtMDFmNzY3Mzg2YmVjIiwiY2xpZW50X2lkIjoiNDJoczNlZnAxZXNwNmp1MjJiNDh0MXNiYjkiLCJ1c2VybmFtZSI6ImZlYWY4NmQyLWI0NWQtNGNiYi1hZTVjLWQ0NThlN2JkMDVjZCJ9.iIXY_M5nPNZES7D6FAp67SHtCJUGQ34uThTgchCtv3B-V_Zue6V_CaiBfKByAmauSmObPp0ZBavltWFvKMIWXFu-o_fUdQ_g-TXE_hWY9EDpPYxlq1hEo214by_6TMbre6N0hwDojLhVj430AS2dFki3FvMS_tST6eJMC84zGt385bLcrI2bovJgM_6qTGGV6OSVWybdK0iPIDQc8CV-MpnDU6Dgqx6Dtpb4Y-4qh1A7xe5Jt6tfbTWxUpUh6CaRy2pUiG10Aej3LgcZcxiyJdHcndNKUqG8BKBr-cG9_2IsDrJVoPQgBa-COPOWCoi9L7Qn18XU-_AxMHaB0CvcMA</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>